erp3l/src/Documents/ПротоколРассмотренияЗаявок/ПротоколРассмотренияЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколРассмотренияЗаявок</name>
  <attributes>
    <name>ДатаВскрытияКонвертов</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЛот</name>
    <type>
      <types>CatalogRef.Лоты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведенияПроцедуры</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтмены</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВскрытияКонвертов</name>
    <type>
      <types>DocumentRef.ПротоколВскрытияКонвертов</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерЕИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатРаботыКомиссии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ЕИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупочнаяПроцедура</name>
    <type>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредложенияПоставщиков</name>
    <attributes>
      <name>ПредложениеПоставщика</name>
      <type>
        <types>DocumentRef.ПредложениеПоставщика</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопущенКУчастию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Enums/СпособыВыбораПоставщика/СпособыВыбораПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВыбораПоставщика</name>
  <enumValues>
    <name>ЗакупкаУЕдинственногоПоставщика</name>
  </enumValues>
  <enumValues>
    <name>Конкурс</name>
  </enumValues>
  <enumValues>
    <name>Аукцион</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКотировок</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПредложений</name>
  </enumValues>
  <enumValues>
    <name>КвалификационныйОтбор</name>
  </enumValues>
  <enumValues>
    <name>Редукцион</name>
  </enumValues>
  <enumValues>
    <name>КонкурентныеПереговоры</name>
  </enumValues>
  <enumValues>
    <name>КонкурсУМсп</name>
  </enumValues>
  <enumValues>
    <name>АукционУМсп</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКотировокУМсп</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПредложенийУМсп</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Documents/ПротоколРассмотренияЗаявок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Функция МожноВвестиНаОснованииЗакупки(ЗакупочнаяПроцедура) Экспорт
	Если НЕ ЗначениеЗаполнено(ЗакупочнаяПроцедура) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Справочники.ЗакупочныеПроцедуры.ЭтоФЗ223(ЗакупочнаяПроцедура)
			И Перечисления.СпособыВыбораПоставщика.ЭтоАукцион(
								ЗакупочнаяПроцедура.СпособВыбораПоставщика);
КонецФункции

Функция ТребуетсяДляЕИС(ЗакупочнаяПроцедура) Экспорт
	Если НЕ ЗначениеЗаполнено(ЗакупочнаяПроцедура) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Справочники.ЗакупочныеПроцедуры.ЭтоФЗ223(ЗакупочнаяПроцедура)
			И (Перечисления.СпособыВыбораПоставщика.ЭтоАукцион(
								ЗакупочнаяПроцедура.СпособВыбораПоставщика)
				ИЛИ ЗакупочнаяПроцедура.СпособВыбораПоставщика =
							Перечисления.СпособыВыбораПоставщика.Конкурс);
КонецФункции
									
// Добавить строку в ТЧ "ПредложенияПоставщиков" документ ПредложениеПоставщика.
// Проверка того, что предложение поставщика уже есть в ТЧ не производится.
// Параметры:
//	ПредложенияПоставщиков - Документ.ПротоколВскрытияКонвертов.ПредложенияПоставщиков -
//			табличная часть.
//  ПредложениеПоставщика - ДокументСсылка.ПредложениеПоставщика - предложение поставщика для добавления.
//
// Возвращает:
//	Строка табличной части "ПредложенияПоставщиков" - заполненная по документу предложения поставщика.
//
Функция ДобавитьСтрокуПредложенияПоставщика(ПредложенияПоставщиков,	ПредложениеПоставщика) Экспорт
	Если НЕ ЗначениеЗаполнено(ПредложениеПоставщика) Тогда
		Возврат Неопределено;
	КонецЕсли;
	мСтроки = ПредложенияПоставщиков.НайтиСтроки(
		Новый Структура("ПредложениеПоставщика", ПредложениеПоставщика));
	Если мСтроки.Количество() > 0 Тогда
		Возврат мСтроки[0];
	КонецЕсли;
	НоваяСтрока = ПредложенияПоставщиков.Добавить();
	НоваяСтрока.ПредложениеПоставщика	 = ПредложениеПоставщика;
	НоваяСтрока.ДопущенКУчастию			 = ПредложениеПоставщика.ДопущенКУчастию;
	НоваяСтрока.ПричинаОтказа			 = ПредложениеПоставщика.ПричинаОтказаВДоступе;
	Возврат НоваяСтрока;
КонецФункции

#КонецЕсли
